{
  "backend/main.mo": "Main backend actor implementing a gig economy platform with worker/agent profiles, task management, payments via Stripe, notifications, access control, blob storage, and dashboard statistics with platform fee handling.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to fixing infinite loading spinner on WorkerDashboard, adding error boundary with 5-second timeout, and investigating data fetching failures in useQueries hooks.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration, detailing authentication flow, dashboard functionality, analytics, settings, and internationalization with Portuguese/English support.",
  "frontend/.env.example": "Environment variable template defining VITE_TEST_MODE flag to control test mode UI elements visibility in production.",
  "frontend/index.css": "Global Tailwind CSS styles with custom OKLCH color palette defining Portuguese-inspired warm earth tones for light and dark themes across all UI components.",
  "frontend/index.html": "HTML entry point with Portuguese locale, SEO meta tags, Open Graph/Twitter cards, PWA manifest, theme color configuration, and Leaflet/Google Fonts preloads for the CanisterTask application.",
  "frontend/public/manifest.json": "PWA manifest defining CanisterTask as a standalone app with Portuguese locale, business/productivity categories, theme colors, and icon configurations for mobile installation.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (dashboard, analytics, settings, admin, notifications, legal pages, payment flows), React Query client, theme provider, and authentication/profile setup gates within a Layout wrapper.",
  "frontend/src/components/AgeGate.tsx": "Age verification modal requiring users to confirm 18+ age before platform access, with sessionStorage persistence and non-dismissible dialog that renders children only after verification.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate component that shows login UI for unauthenticated users, loading states during initialization, and wraps children with AgeGate and ProfileSetup when authenticated.",
  "frontend/src/components/DeploymentStatus.tsx": "Displays deployment status card showing three mainnet canisters (main, escrow, stats) with their IDs and links to the Internet Computer network.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches errors in child components and displays a fallback UI with retry functionality.",
  "frontend/src/components/Footer.tsx": "Footer component with branding, navigation links, legal information, and social media sharing buttons for WhatsApp, Twitter, Telegram, and LinkedIn.",
  "frontend/src/components/GDPRConsent.tsx": "GDPR consent checkbox component with links to privacy policy and terms, accepting checked state and change handler as props.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, navigation links, theme toggle, language selector, notification bell, admin link for admins, and authentication button with mobile menu support.",
  "frontend/src/components/NotificationBell.tsx": "Notification bell icon with unread count badge that opens a popover displaying unread notifications with mark-as-read functionality and relative timestamps.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog that prompts new users to create a worker profile with default Évora location settings, appearing when no user profile exists and redirecting to dashboard after creation.",
  "frontend/src/components/TaskHeatmap.tsx": "React component that dynamically loads Leaflet and renders a geographic heatmap of tasks (active, completed, earnings) centered on Portugal with mock data generated from dashboard stats.",
  "frontend/src/components/TestModeStats.tsx": "Displays a test mode statistics card showing simulated task counts and earnings with a distinctive amber-themed UI and test badge.",
  "frontend/src/config/features.ts": "Feature flag configuration that controls test mode visibility via TEST_MODE_ENABLED, defaulting to true unless VITE_TEST_MODE environment variable is 'false'.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBrowserNotifications.ts": "Hook for managing browser notification permissions and displaying notifications with click handlers that navigate to the dashboard.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout with AuthClient, managing identity state and delegation validation.",
  "frontend/src/hooks/useLoadingTimeout.ts": "Hook that tracks whether a loading state has exceeded a configurable timeout (default 5 seconds) with reset capability.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, dashboard stats, daily earnings, notifications, and admin status from the backend actor.",
  "frontend/src/hooks/useTestMode.ts": "Hook for simulating task completions in test mode, calculating worker earnings and platform fees, and tracking accumulated test statistics.",
  "frontend/src/hooks/useTranslation.ts": "Internationalization hook providing Portuguese and English translations for UI strings across authentication, profile, navigation, dashboard, analytics, and settings.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components using HSL values.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/About.tsx": "About page displaying platform information in three cards: decentralized ICP architecture, secure escrow payments, and EU/PT GDPR compliance.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only dashboard showing platform statistics, daily earnings charts, task metrics, and date-filtered analytics with refresh functionality.",
  "frontend/src/pages/Analytics.tsx": "Analytics page displaying a TaskHeatmap component to visualize task density and distribution.",
  "frontend/src/pages/Notifications.tsx": "Notifications page listing user notifications with mark-as-read functionality, showing timestamps and task details with unread badges.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure page displaying an error message with a red X icon and a button to return to the dashboard.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success page displaying a confirmation message with a green checkmark icon and a button to return to the dashboard.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Privacy policy page displaying GDPR-compliant data handling information in multiple sections, with bilingual support (PT/EN).",
  "frontend/src/pages/Settings.tsx": "Settings page component that displays notification preferences (browser notifications with permission handling) and auto-refresh toggle using shadcn/ui Card components.",
  "frontend/src/pages/TermsOfService.tsx": "Terms of Service page displaying bilingual (PT/EN) legal content about gig economy platform usage, payments, liability, and dispute resolution in Card components.",
  "frontend/src/pages/WorkerDashboard.tsx": "Worker dashboard page that fetches user profile and notifications, displays test mode tasks, handles browser notifications, and implements error boundary with 5-second loading timeout and retry functionality.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme (fonts, shadows, animations), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file documenting the fix request for infinite loading spinner on worker dashboard, including three feature entries for error handling and data fetching fixes."
}