{
  "backend/main.mo": "Main backend actor implementing a gig economy platform with worker/agent profiles, task management, payments with 7% platform fee, Stripe integration, access control, blob storage, notifications, and analytics including daily summaries and dashboard statistics.",
  "feature_evidence.json": "Feature evidence report documenting implementation of professional footer, GDPR-compliant privacy policy, terms of service, and cookies pages with Portuguese/English translations and EU Platform Work Directive compliance.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including authentication flow, legal pages, worker dashboard, analytics, profiles, and internationalization with Portuguese/English support.",
  "frontend/.env.example": "Environment configuration template with VITE_TEST_MODE flag to control test mode UI elements visibility in production.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, including color schemes for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point with comprehensive SEO meta tags, Open Graph/Twitter cards, PWA configuration, geo-tagging for Évora Portugal, and Leaflet CSS for map functionality.",
  "frontend/public/manifest.json": "PWA manifest defining CanisterTask as a standalone app with Portuguese locale, business/productivity categories, and icon configurations for various sizes.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (dashboard, analytics, workers, legal pages, profiles) wrapped in AuthGate, ThemeProvider, QueryClientProvider, and including CookieConsentBanner.",
  "frontend/src/components/AgeGate.tsx": "Age verification dialog component that checks sessionStorage for age verification and displays a modal requiring users to confirm they are 18+ before accessing the app content.",
  "frontend/src/components/AuthGate.tsx": "Authentication wrapper component that displays a login screen for unauthenticated users, shows loading states during initialization, and wraps authenticated content with AgeGate and ProfileSetup components.",
  "frontend/src/components/CookieConsentBanner.tsx": "Cookie consent banner component that appears at the bottom of the screen if consent hasn't been given, offering options to accept or configure cookie preferences via localStorage.",
  "frontend/src/components/DeploymentStatus.tsx": "Status card displaying three mainnet canisters (main, escrow, stats) with their IDs, descriptions, and links to their ICP endpoints.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary class component that catches rendering errors and displays a fallback UI with error details and a reset button.",
  "frontend/src/components/Footer.tsx": "Application footer with four columns containing branding, navigation links, legal links, platform info (7% fee), and attribution to caffeine.ai with dynamic UTM tracking.",
  "frontend/src/components/GDPRConsent.tsx": "GDPR consent checkbox component with links to privacy policy and terms, used for collecting user consent during registration or profile setup.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, nav links (Home, Tasks, Profile, Workers, Admin), theme toggle, language selector, notification bell, and authentication button with mobile sheet menu support.",
  "frontend/src/components/NotificationBell.tsx": "Notification bell icon with unread count badge that opens a popover displaying unread notifications with timestamps and mark-as-read functionality.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog component that prompts new users to create a worker profile with default values for Évora location, including GDPR consent links and navigation to dashboard after profile creation.",
  "frontend/src/components/TaskHeatmap.tsx": "Interactive Leaflet-based heatmap component that visualizes task distribution across Portugal (Évora and Lisboa regions) with three layers: active tasks, completed tasks, and earnings, dynamically loading Leaflet libraries and generating mock location data from dashboard stats.",
  "frontend/src/components/TestModeStats.tsx": "Card component displaying test mode statistics (total tasks and earnings) with amber-colored styling and badges to indicate simulated data that doesn't affect real data.",
  "frontend/src/components/WorkerCard.tsx": "Card component displaying worker profile information including avatar, name, rating, location, hourly price, skills, completed tasks, earnings, and last task details with navigation to detailed profile view.",
  "frontend/src/config/features.ts": "Feature flags configuration file that controls test mode visibility through TEST_MODE_ENABLED flag, which can be overridden via VITE_TEST_MODE environment variable.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with admin token from URL parameters.",
  "frontend/src/hooks/useBrowserNotifications.ts": "Hook managing browser notification permissions and displaying notifications with task-specific actions that navigate to dashboard when clicked.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options for idle behavior and derivation origin.",
  "frontend/src/hooks/useLoadingTimeout.ts": "Hook that tracks whether a loading state has exceeded a configurable timeout duration (default 5 seconds) with reset functionality.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, dashboard stats, daily earnings, notifications, and admin checks from the backend actor. Includes retry logic, stale time configurations, and query invalidation on mutations.",
  "frontend/src/hooks/useTestMode.ts": "Provides a hook for simulating task completions in test mode, calculating worker earnings and platform fees (7%), and tracking accumulated stats (total tasks and earnings).",
  "frontend/src/hooks/useTranslation.ts": "Implements i18n support for Portuguese and English, providing translations for navigation, authentication, footer, dashboard, notifications, workers, profile, and admin sections with language switching functionality.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for theming (light and dark modes), including colors for backgrounds, foregrounds, borders, and chart colors using HSL color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component with necessary context providers.",
  "frontend/src/pages/About.tsx": "Displays the About page with mission statement, founder information (Hermínio Coragem from Évora, Portugal), platform details (7% fee, ICP mainnet), payment security, and EU/PT compliance information in both Portuguese and English.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page showing platform statistics, daily summaries, 7-day trends with charts, and custom date range earnings reports. Includes access control checks and refresh functionality for real-time data updates.",
  "frontend/src/pages/Analytics.tsx": "Analytics page that displays a TaskHeatmap component showing task density visualization with translated titles and descriptions.",
  "frontend/src/pages/Cookies.tsx": "Displays a bilingual (PT/EN) cookie policy page explaining essential cookies, local storage usage, and cookie management options using Card components and icons.",
  "frontend/src/pages/MyProfile.tsx": "Shows the authenticated user's worker profile with stats (earnings, tasks, rating), skills, location, and recent activity; includes loading states and navigation to settings.",
  "frontend/src/pages/Notifications.tsx": "Displays a list of user notifications with read/unread status, allows marking individual or all notifications as read, and shows empty state when no notifications exist.",
  "frontend/src/pages/PaymentFailure.tsx": "Shows a payment failure screen with an error icon and a button to return to the dashboard.",
  "frontend/src/pages/PaymentSuccess.tsx": "Shows a payment success confirmation screen with a success icon and a button to return to the dashboard.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Renders a comprehensive bilingual (PT/EN) GDPR-compliant privacy policy covering data collection, usage, sharing, user rights, security, and EU Platform Work Directive compliance.",
  "frontend/src/pages/PublicProfile.tsx": "Displays a public view of a worker's profile by Principal ID, showing their name, skills, location, rating, and completed tasks with error handling for invalid or missing profiles.",
  "frontend/src/pages/Settings.tsx": "Settings page component that manages browser notification permissions and user preferences (like auto-refresh) using cards and switches.",
  "frontend/src/pages/TermsOfService.tsx": "Terms of Service page displaying legal information about the gig economy platform, including payment structure (7% fee), user obligations, liability disclaimers, and EU compliance in Portuguese and English.",
  "frontend/src/pages/WorkerDashboard.tsx": "Worker dashboard showing available tasks, profile data, notifications, and test mode functionality with error handling, loading states, and browser notification integration.",
  "frontend/src/pages/Workers.tsx": "Workers listing page displaying mock worker profiles with search functionality, showing skills, ratings, completed tasks, and earnings using WorkerCard components.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH, container settings, extended theme with custom fonts (Inter, Playfair Display), shadows, animations, and plugins for typography and animations.",
  "project_state.json": "Project state file tracking CanisterTask, a GDPR-compliant gig economy platform on ICP with 7% fee structure, EU Platform Work Directive compliance, and PWA architecture. Documents existing features including legal pages (privacy, terms, cookies), professional footer, cookie consent system, and worker/task management functionality."
}