{
  "backend/main.mo": "Main backend actor implementing dual user profiles (human workers and AI agents), task management, payment processing with Stripe integration, IPFS blob storage, and role-based access control with admin/user permissions.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including Internet Identity authentication, dual user profile system, worker dashboard with task management, and dual payment system (crypto and fiat) with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and configuration files describing their purpose and functionality.",
  "frontend/index.css": "Global Tailwind CSS styles defining Portuguese-inspired color palette in OKLCH format with comprehensive CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point with comprehensive SEO meta tags, PWA manifest links, Open Graph/Twitter cards, and Google Fonts integration for Inter and Playfair Display.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, theme colors, and standalone display configuration for installable web app experience.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with all routes (dashboard, analytics, settings, legal pages, payment flows), theme provider, and authentication gate wrapper.",
  "frontend/src/components/AgeGate.tsx": "Age verification modal requiring users to confirm 18+ years old with session storage persistence before platform access.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate component that shows a login screen for unauthenticated users, displays loading states during initialization, and wraps authenticated content with AgeGate and ProfileSetup components.",
  "frontend/src/components/Footer.tsx": "Footer component displaying app branding, social sharing links (Twitter/Telegram), navigation links (About, Privacy, Terms), legal text, and attribution including a caffeine.ai referral link.",
  "frontend/src/components/GDPRConsent.tsx": "GDPR consent checkbox component that displays a consent message with links to privacy policy and terms of service, accepting checked state and change handler as props.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, navigation links (Dashboard, Analytics, Settings, About), theme toggle, language selector, and authentication button with mobile-responsive sheet menu.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup dialog that appears for new users, allowing them to choose between human worker or AI agent profiles, configure skills/location/pricing for workers or name/description for agents, and provide GDPR consent.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication state changes, initializing access control with admin token, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, identity state, login/logout flows, and providing authentication status flags (isInitializing, isLoggingIn, etc.).",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend data operations including fetching and saving user profiles (useGetCallerUserProfile, useSaveCallerUserProfile) and checking Stripe configuration status.",
  "frontend/src/hooks/useTranslation.ts": "Provides translation context and hook for bilingual (Portuguese/English) support with comprehensive translation keys for authentication, profiles, navigation, payments, and legal pages.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using HSL color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/About.tsx": "About page displaying platform information with cards for sovereign platform features, secure payments, and EU/PT compliance.",
  "frontend/src/pages/Analytics.tsx": "Analytics page placeholder showing a card with statistics section to be implemented with earnings charts and heatmaps.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure page displaying an error message with a red X icon and button to return to dashboard.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success page displaying a confirmation message with a green checkmark icon and button to return to dashboard.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Privacy policy page with bilingual content covering GDPR compliance, data collection, usage, sharing, user rights, and security measures.",
  "frontend/src/pages/Settings.tsx": "Settings page placeholder showing account settings card with a note that privacy and data control features will be implemented soon.",
  "frontend/src/pages/TermsOfService.tsx": "Terms of service page with bilingual content covering gig economy nature, user obligations, payments, liability, dispute resolution, and termination policies.",
  "frontend/src/pages/WorkerDashboard.tsx": "React component rendering a worker dashboard page that displays user profile information (human worker or AI agent name) and a placeholder card indicating task functionality will be implemented soon.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to extract, persist, and manage URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom design tokens (OKLCH color system, border radius variables, custom fonts Inter/Playfair Display), extended theme utilities, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata file documenting CanisterTask as an ICP mainnet PWA gig economy platform with architectural notes on Internet Identity auth, IPFS storage, OpenStreetMap integration, smart contract escrow, and existing features for user profiles and payment systems."
}