{
  "backend/main.mo": "Main backend actor implementing a gig economy platform with authorization, blob storage, Stripe payments, task management, worker/AI agent profiles, submissions, notifications, and admin dashboard statistics with 7% platform fees.",
  "feature_evidence.json": "Feature evidence report documenting completed features including footer branding updates, social media buttons, admin dashboard earnings charts, and real-time statistics with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and styling with descriptions of routing, authentication flow, dashboard features, analytics, notifications, and internationalization.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color palette for light and dark themes using Portuguese-inspired warm earth tones, including sidebar, chart, and destructive color variables.",
  "frontend/index.html": "HTML entry point with PWA configuration, SEO meta tags, Open Graph/Twitter cards, Leaflet CSS for maps, Google Fonts (Inter and Playfair Display), and CanisterTask branding metadata.",
  "frontend/public/manifest.json": "PWA manifest defining CanisterTask as a standalone app with Portuguese locale, business/productivity categories, theme colors, and 512x512 icon configuration for maskable and standard purposes.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (dashboard, analytics, settings, legal, payment, admin, notifications), React Query client, theme provider, and authentication/profile setup gates in Layout wrapper.",
  "frontend/src/components/AgeGate.tsx": "Age verification modal requiring 18+ confirmation with session storage persistence, blocking access until verified, and rendering children components after verification with internationalization support.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate component that displays login UI for unauthenticated users and wraps authenticated content with AgeGate and ProfileSetup components. Shows loading states during initialization and login.",
  "frontend/src/components/DeploymentStatus.tsx": "Displays deployment status card showing three mainnet canisters (main, escrow, stats) with their IDs and links to the Internet Computer network.",
  "frontend/src/components/Footer.tsx": "Footer component with branding, navigation links, legal information, and social media share buttons for WhatsApp, Twitter/X, Telegram, and LinkedIn.",
  "frontend/src/components/GDPRConsent.tsx": "GDPR consent checkbox component with links to privacy policy and terms, used during user registration or profile setup.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, navigation links, theme toggle, language selector, notification bell, and authentication button. Includes admin link for authorized users and responsive mobile menu.",
  "frontend/src/components/NotificationBell.tsx": "Notification bell icon with unread count badge and popover displaying recent notifications with timestamps and mark-as-read functionality.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog for first-time profile setup requiring user name and GDPR consent, creates a human worker profile and blocks app access until completed.",
  "frontend/src/components/TaskHeatmap.tsx": "React component that dynamically loads Leaflet and renders an interactive heatmap showing task density (active, completed, earnings) across Évora and Lisboa regions using mock geolocation data.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBrowserNotifications.ts": "Custom hook that manages browser notification permissions and displays notifications with navigation support, including task-specific notifications with click handlers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, dashboard stats, daily earnings, notifications, and admin status from the backend actor.",
  "frontend/src/hooks/useTranslation.ts": "Custom hook providing i18n support with Portuguese and English translations for authentication, profile, navigation, dashboard, analytics, and settings UI strings.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color space for consistent design tokens.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers before rendering the main App component.",
  "frontend/src/pages/About.tsx": "Displays an About page with three cards explaining the platform's sovereign architecture on ICP, secure escrow-based payments with crypto and fiat support, and EU/PT compliance including GDPR and tax reporting.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only dashboard showing platform statistics (total tasks, completed tasks, earnings, users), daily earnings charts, and a date-range filterable table of daily stats with 7-day trend visualization using Recharts.",
  "frontend/src/pages/Analytics.tsx": "Analytics page that renders a TaskHeatmap component to visualize task density and geographic distribution.",
  "frontend/src/pages/Notifications.tsx": "Displays a list of user notifications with unread badges, individual and bulk mark-as-read functionality, and formatted timestamps.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure page showing an error icon, failure message, and a button to return to the dashboard.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success page showing a success icon, confirmation message, and a button to return to the dashboard.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Privacy policy page with bilingual (PT/EN) content covering GDPR compliance, data collection, usage, sharing, user rights, and security measures.",
  "frontend/src/pages/Settings.tsx": "Settings page for managing browser notification permissions with status alerts and an auto-refresh preference toggle.",
  "frontend/src/pages/TermsOfService.tsx": "Displays Terms of Service page with bilingual content (Portuguese/English) covering gig economy disclaimers, user obligations, payments via smart contracts, and dispute resolution.",
  "frontend/src/pages/WorkerDashboard.tsx": "Worker dashboard showing available tasks with status badges, location, and pricing; includes browser notifications for new tasks and displays user profile information.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended typography, animations, and custom font families (Inter, Playfair Display).",
  "project_state.json": "Project metadata tracking CanisterTask features including admin dashboard, earnings tracking, social media integration, and pending feature requests for branding updates and real-time statistics."
}