{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix infinite loading spinner on dashboard",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the infinite loading spinner that appears on the worker dashboard, preventing users from seeing any content below the header",
      "acceptanceCriteria": [
        "The dashboard loads completely without getting stuck in a loading state",
        "Task list or appropriate content displays below the CanisterTask header",
        "No infinite spinner blocks the user interface"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/WorkerDashboard.tsx",
          "operation": "modify",
          "description": "Add error handling and conditional rendering to prevent infinite loading states. Ensure that the component renders content when data is available or shows an error state when queries fail. Add fallback UI if dashboard stats are unavailable. Verify that all useQuery hooks properly handle loading, error, and success states."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add error boundary and loading state timeout (5 seconds) to the WorkerDashboard component to prevent indefinite loading states",
      "acceptanceCriteria": [
        "Loading spinner times out after 5 seconds if data doesn't load",
        "Appropriate error message displays if loading fails",
        "User can retry loading manually"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ErrorBoundary.tsx",
          "operation": "create",
          "description": "Create a React error boundary component that catches rendering errors in child components and displays a fallback UI with an error message and retry button. Include props for custom error messages and retry handlers."
        },
        {
          "path": "frontend/src/pages/WorkerDashboard.tsx",
          "operation": "modify",
          "description": "Wrap the dashboard content with the ErrorBoundary component. Implement a loading timeout mechanism that transitions to an error state after 5 seconds if data fetching hasn't completed. Add a retry function that refetches dashboard data and resets the timeout. Display a user-friendly error message with a retry button when the timeout triggers or when queries fail."
        },
        {
          "path": "frontend/src/hooks/useLoadingTimeout.ts",
          "operation": "create",
          "description": "Create a custom hook that manages a loading timeout state. The hook should accept a timeout duration (default 5000ms) and isLoading boolean, and return a hasTimedOut boolean flag and a reset function. Use useEffect with setTimeout to trigger the timeout when isLoading is true for longer than the specified duration."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Investigate and fix the root cause of the dashboard data fetching failure in useQueries hooks or useActor",
      "acceptanceCriteria": [
        "Dashboard stats query completes successfully",
        "Actor initialization completes without errors",
        "Console shows no React Query errors or failed network requests"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and fix the useDashboardStats hook to ensure proper error handling and actor availability checks. Add retry logic with exponential backoff for failed queries. Ensure the enabled flag properly waits for actor initialization before attempting queries. Add console logging for debugging query states (enabled, isLoading, error) without exposing sensitive data."
        },
        {
          "path": "frontend/src/pages/WorkerDashboard.tsx",
          "operation": "modify",
          "description": "Add comprehensive error logging to identify the root cause of data fetching failures. Log actor state, query states, and any error objects from useQueries hooks. Ensure all query dependencies (actor, authentication state) are properly checked before rendering dependent UI. Add defensive checks for undefined or null data before rendering dashboard stats."
        }
      ]
    }
  ]
}