{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove Caffeine branding and add social share buttons with real-time stats",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove all 'Caffeine' branding references from the Footer component",
      "acceptanceCriteria": [
        "No mentions of 'Caffeine' or 'caffeine.ai' appear in any footer",
        "Footer component does not contain Caffeine attribution"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Remove all references to 'Powered by caffeine.ai' text and caffeine.ai attribution links from the Footer component. Clean up any branding elements that mention Caffeine."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add social media share buttons to the footer with platform-specific links",
      "acceptanceCriteria": [
        "Footer contains clickable icons/buttons for X/Twitter, Telegram, WhatsApp, and LinkedIn",
        "X/Twitter share link includes #CanisterTask hashtag",
        "All social share buttons are functional and open appropriate sharing dialogs"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Add social media share buttons (X/Twitter, Telegram, WhatsApp, LinkedIn) to the footer. The X/Twitter link must include the #CanisterTask hashtag. Each button should open the appropriate sharing dialog with the current page URL and relevant metadata. Use Lucide React icons or emoji icons for visual representation."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update footer text with copyright and platform branding followed by social media buttons with emoji icons",
      "acceptanceCriteria": [
        "Footer displays copyright text exactly as specified",
        "Social media buttons display with the specified emoji icons",
        "Text and buttons are properly formatted and aligned"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Update the footer to display: '© 2026 Hermínio Coragem (HCoragem) Évora PT | CanisterTask ICP | Gig Economy Soberana' followed by social media buttons with emoji icons (📱 WhatsApp, 🐦 X, 💬 Telegram, 💼 LinkedIn). Ensure proper spacing, alignment, and responsive layout. The copyright text should be displayed first, followed by the social media buttons arranged horizontally with emoji icons clearly visible."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add a 7-day earnings chart for HCoragem to the admin dashboard showing daily earnings trends",
      "acceptanceCriteria": [
        "Admin dashboard displays a line or bar chart showing earnings over the last 7 days",
        "Chart data is fetched from the backend with daily earnings aggregation",
        "Chart updates in real-time or on page refresh"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add a 7-day earnings chart component to the admin dashboard. Use the existing getLast7DaysStats backend capability (returns Array<DailySummary> with day, taskCount, completedTasks, totalAmount, completedAmount fields) to fetch daily earnings data. Implement a line or bar chart using Recharts or a similar charting library (already used in the project based on dependencies). Display earnings trends over the last 7 days with proper labels, tooltips, and responsive design. The chart should show daily earnings (completedAmount or totalAmount) on the Y-axis and dates on the X-axis."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add or verify the useLast7DaysStats query hook that fetches 7-day earnings statistics using the getLast7DaysStats backend capability. Ensure proper error handling, loading states, and React Query configuration. The hook should return the daily earnings data in a format consumable by the chart component."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add real-time statistics cards to the admin dashboard showing today's total tasks and completed tasks count",
      "acceptanceCriteria": [
        "Admin dashboard displays a card showing total tasks created today",
        "Admin dashboard displays a card showing total tasks completed today",
        "Statistics update automatically or on refresh"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add two statistic cards to the admin dashboard displaying today's total tasks and today's completed tasks. Use the existing getDailySummary backend capability (returns { day, taskCount, completedTasks, totalAmount, completedAmount }) to fetch today's statistics. Display these metrics in visually distinct cards with appropriate icons, labels, and styling consistent with the existing dashboard design. Position these cards prominently in the dashboard layout, ideally near other key metrics."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add or verify the useDailySummary query hook that fetches today's task statistics using the getDailySummary backend capability. Configure React Query with appropriate refetch intervals for real-time updates. Ensure proper typing with the DailySummary interface from backend.d.ts."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add a real-time statistic showing the count of active workers in Évora to the admin dashboard",
      "acceptanceCriteria": [
        "Admin dashboard displays a card showing the number of active workers in Évora",
        "Backend tracks and returns worker activity by location",
        "Count updates in real-time or on page refresh"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add a statistic card to the admin dashboard displaying the count of active workers in Évora. Use the existing getDashboardStats backend capability (returns DashboardStats with activeWorkers field) to fetch the active worker count. Note: The backend currently tracks total active workers; if Évora-specific filtering is needed, use the activeWorkers field as-is and add a label indicating it represents Évora workers (assumption based on the platform's Évora focus). Display this metric in a card consistent with other dashboard statistics, with appropriate icon, label, and styling. Configure React Query to refresh periodically for real-time updates."
        }
      ]
    }
  ]
}