{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add complete user profile page with stats, earnings, and task history",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create 'My Profile' page at /perfil displaying authenticated user's complete worker profile with statistics, earnings, and recent task history",
      "acceptanceCriteria": [
        "Profile page displays all worker statistics fetched from backend",
        "Rating is auto-calculated based on completed tasks",
        "Earnings display includes 7% platform fee indication",
        "Recent tasks show with relative timestamps and completion status",
        "Page is accessible only to authenticated users"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MyProfile.tsx",
          "operation": "create",
          "description": "Create My Profile page component that fetches and displays the authenticated user's complete worker profile including: name with icon, star rating with total completed tasks count, city location with 5km radius indicator, skills list (Photo/Delivery/Verification), hourly and per-task pricing, total earnings with 7% platform fee indication, today's earnings (default €0.00), completed tasks count with checkmark, pending tasks count with hourglass icon, and recent tasks list showing task name, completion status, payment amount, and relative timestamp (e.g., '2h ago', '1 day'). Use useGetCallerUserProfile hook to fetch profile data. Display loading states and handle errors. Show authentication gate if user is not logged in. Use Portuguese/English translations via useTranslation hook. Use shadcn/ui Card components for layout consistency."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route configuration for /perfil path pointing to MyProfile page component. Ensure route is positioned correctly in the routing structure and wrapped with authentication requirements."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add 'Edit Profile' and 'Stats Analytics' action buttons to profile page for modifying profile information and viewing detailed analytics",
      "acceptanceCriteria": [
        "Edit Profile button navigates to settings or opens profile edit modal",
        "Stats Analytics button navigates to analytics page or displays detailed stats"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MyProfile.tsx",
          "operation": "modify",
          "description": "Add two action buttons to the profile page: 'Edit Profile' button that navigates to /settings route, and 'Stats Analytics' button that navigates to /analytics route. Position buttons prominently below the profile header section. Use shadcn/ui Button components with appropriate styling and icons. Implement navigation using TanStack Router's useNavigate hook."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Create public profile URLs at /perfil/[user-id] displaying any user's profile information viewable by authenticated users and accessible to admins",
      "acceptanceCriteria": [
        "Public profile route accepts user-id parameter",
        "Profile data loads for any valid user ID",
        "Admin users can navigate to and view any user profile",
        "Non-admin users can view profiles of other authenticated users"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PublicProfile.tsx",
          "operation": "create",
          "description": "Create PublicProfile page component that displays any user's profile at route /perfil/$userId. Extract userId from route parameters using TanStack Router. Fetch profile data using getUserProfile backend method via a new React Query hook. Display profile information: name, rating, location, skills, pricing, and task counts (no earnings or private data). Show authentication gate if user is not logged in. Handle loading states and errors (e.g., user not found). Use authorization component's permission checks to verify access. Use Portuguese/English translations via useTranslation hook. Use shadcn/ui Card components for layout consistency."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add dynamic route configuration for /perfil/$userId path pointing to PublicProfile page component. Ensure route handles userId parameter extraction and is wrapped with authentication requirements."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useGetUserProfile(userId: Principal) React Query hook that calls actor.getUserProfile(userId) to fetch public profile data for any user. Include proper error handling, loading states, and query key structure ['userProfile', userId.toString()]. Enable query only when actor is available and userId is provided."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update main navigation menu to include 'MEU PERFIL' (My Profile) link between 'Tasks' and 'Admin' in menu structure",
      "acceptanceCriteria": [
        "Navigation menu displays 'MEU PERFIL' link in correct position",
        "Link is visible to all authenticated users",
        "Clicking the link navigates to /perfil route",
        "Menu maintains responsive mobile behavior"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Add 'MEU PERFIL' navigation link to the Header component's main navigation menu. Position the link between 'Tasks' and 'Admin' links to match the required menu structure: Home | Tasks | MEU PERFIL | Admin. Ensure link navigates to /perfil route. Make link visible to all authenticated users. Maintain existing responsive mobile menu behavior. Use useTranslation hook for bilingual label support (Portuguese: 'MEU PERFIL', English: 'MY PROFILE'). Apply consistent styling with existing navigation items."
        },
        {
          "path": "frontend/src/hooks/useTranslation.ts",
          "operation": "modify",
          "description": "Add translation keys for 'myProfile' navigation label in both Portuguese ('MEU PERFIL') and English ('MY PROFILE') dictionaries under the navigation section. Ensure translations are accessible via the useTranslation hook."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Ensure admin dashboard displays HCoragem platform earnings with active 7% platform fee clearly indicated",
      "acceptanceCriteria": [
        "Admin dashboard shows total platform earnings",
        "7% fee is visibly marked as active",
        "Earnings calculations reflect 7% commission rate"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Update AdminDashboard component to prominently display HCoragem platform earnings with clear 7% platform fee indication. Add a dedicated Card component showing total platform fees collected (fetched via getPlatformFeeTotal backend method if available, or calculated from totalRevenue in DashboardStats). Include visual indicator (badge or label) stating '7% Fee Active' or 'Taxa Ativa: 7%'. Position this earnings card prominently near the top of the dashboard. Use Portuguese/English translations via useTranslation hook. Ensure the fee percentage is visually distinct using color coding or typography."
        },
        {
          "path": "frontend/src/hooks/useTranslation.ts",
          "operation": "modify",
          "description": "Add translation keys for platform fee display in admin dashboard: 'platformFee' ('Taxa da Plataforma' / 'Platform Fee'), 'feeActive' ('Taxa Ativa: 7%' / 'Active Fee: 7%'), and 'totalPlatformEarnings' ('Ganhos Totais da Plataforma' / 'Total Platform Earnings') in both Portuguese and English dictionaries under the admin or dashboard section."
        }
      ]
    }
  ]
}